// рисунок в консоле
// синтаксис
// Опр 3 точки
// Выбрать 2 любые
// Найти середину
// Выбрать случайную вершину треугольника
// Соединить ее с полученной на 4ом шаге точкой
// Перейти к шагу 3
// Шаги 3-7 повторить 9,28,31 раз
//Console.Clear();
//Console.SetCursorPosition(10, 4);
//Console.WriteLine("+");   Эта команда показывает расположение точки.

//int xa = 1; можно упростить написание нескольких аргументов
//int ya = 1;
//int xb = 1;
//int yb = 30;

Console.Clear();

int xa = 40, ya = 1, 
    xb = 1, yb = 30, xc = 70, yc = 30;

Console.SetCursorPosition(xa,ya);               //Отображегие вершин треугольника
Console.WriteLine("+");

Console.SetCursorPosition(xb,yb);
Console.WriteLine("+");

Console.SetCursorPosition(xc,yc);
Console.WriteLine("+");


int x = xa, y = xb;

int count = 0;

while(count<10000)
{
    int what = new Random().Next(0,3);  // [0;3)  0 1 2
    if( what == 0)
    {
        x = (x+xa) / 2;
        y = (y+ya) / 2;
    }
//    int what = new Random().Next(0,3);  // [0;3)  0 1 2
    if( what == 1)
    {
        x = (x+xb) / 2;
        y = (y+yb) / 2;
    }
//    int what = new Random().Next(0,3);  // [0;3)  0 1 2
    if( what == 2)
    {
        x = (x+xc) / 2;        // Треугольник и еще 10 отрезков
        y = (y+yc) / 2;
    }
    Console.SetCursorPosition(x,y);
    Console.WriteLine("+");
    count+=1;                           //count++
}



//                                       +++
//                                      +++++
//                                     +++ ++++
//                                   ++++++++++
//                                  ++++    +++++
//                                 ++++++  +++++++
//                               ++++++++++++++++++
//                              +++++++++++++++++++
//                            +++++             +++++
//                           ++++++++         ++++++++
//                          ++++++++++       ++++++++++
//                        ++++     +++      +++     ++++
//                       ++++++   ++++++  ++++++   ++++++
//                      ++++++++ +++ ++++++++++++ +++ ++++
//                     ++++++++++++++++++++++++++++++++++++
//                   ++++                               ++++
//                  +++++++                           +++++++
//                ++++++++++                         +++++++++
//               ++++++++++++                      ++++++++++++
//              +++++   ++++++                    +++++    +++++
//            ++++ +++ +++ ++++                  +++ ++++ +++ +++
//           +++++++++++++++++++                ++++++++++++++++++
//          +++              ++++             ++++             ++++
//        ++++++           +++++++           ++++++           ++++++
//       ++++++++          +++ ++++         ++++++++         ++++++++
//      ++++++++++       +++++++++++      +++++++++++      +++++++++++
//    +++++    +++++    ++++    +++++    ++++     ++++    +++++    ++++
// PS C:\stady\github\Basic_commands_Git\C#\example\example007>  +++++++
//  +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//  +                                                                    +